In [1]:
import pandas as pd
import numpy as np

In [2]:
d1 = {

'Name': ['Pankaj', 'Meghna', 'David', 'Lisa'],

'ID': [1, 2, 3, 4],

'Salary': [100, 200, np.nan, pd.NaT],

'Role': ['CEO', None, pd.NaT, pd.NaT]

}

In [3]:
df = pd.DataFrame(d1)
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [4]:
df.head(2)

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None

In [5]:
df.tail(2)

    Name  ID Salary Role
2  David   3    NaN  NaT
3   Lisa   4    NaT  NaT

In [6]:
df.isnull().sum()

Name      0
ID        0
Salary    2
Role      3
dtype: int64

In [7]:
df1=df.dropna()
df1

     Name  ID Salary Role
0  Pankaj   1    100  CEO

In [8]:
df2 = df.dropna(axis=1)
df2

     Name  ID
0  Pankaj   1
1  Meghna   2
2   David   3
3    Lisa   4

In [10]:
df['Salary'].fillna('CEO',inplace=True)

C:\Users\Safwan\AppData\Local\Temp\ipykernel_8476\186807843.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna('CEO',inplace=True)

In [11]:
df['Role'].fillna('CEO',inplace= True)

In [12]:
df

     Name  ID Salary Role
0  Pankaj   1    100  CEO
1  Meghna   2    200  CEO
2   David   3    CEO  CEO
3    Lisa   4    CEO  CEO